Процедура СеткаДанных1_ДвойноеНажатие()
	Сообщить("СеткаДанных1_ДвойноеНажатие " + ТекущаяУниверсальнаяДатаВМиллисекундах());
КонецПроцедуры

Функция СеткаДанных1_Нажатие()
	Сообщить("СеткаДанных1_Нажатие " + ТекущаяУниверсальнаяДатаВМиллисекундах());
КонецФункции

Функция СеткаДанных1_ПриНажатииКнопкиМыши()
	Сообщить("СеткаДанных1_ПриНажатииКнопкиМыши = " + ТекущаяУниверсальнаяДатаВМиллисекундах());
КонецФункции

Функция СтильКолонкиПолеВвода1_ДвойноеНажатие()
	Сообщить("СтильКолонкиПолеВвода1_ДвойноеНажатие = " + ТекущаяУниверсальнаяДатаВМиллисекундах());
КонецФункции

ПодключитьВнешнююКомпоненту("C:\444\111\OneScriptForms\OneScriptForms\bin\Debug\OneScriptForms.dll");
Ф = Новый ФормыДляОдноСкрипта();
Форма1 = Ф.Форма();
Форма1.Ширина = 600;
Форма1.Отображать = Истина;
Форма1.Показать();
Форма1.Активизировать();

СеткаДанных1 = Форма1.ЭлементыУправления.Добавить(Ф.СеткаДанных());
СеткаДанных1.Стыковка = Ф.СтильСтыковки.Заполнение;
СеткаДанных1.ОтображатьЗаголовок = Истина;
СеткаДанных1.ТекстЗаголовка = "Сетка данных - СтильКолонкиПолеВыбора";
СеткаДанных1.ТолькоЧтение = Ложь;

ТаблицаДанных1 = Ф.ТаблицаДанных("ТД1");
ТаблицаДанных1.Колонки.Добавить(Ф.КолонкаДанных("№ н/п", Ф.ТипДанных.Число));
ТаблицаДанных1.Колонки.Добавить(Ф.КолонкаДанных("ФИО", Ф.ТипДанных.Строка));

ТаблицаДанных2 = Ф.ТаблицаДанных("ТД2");
ТаблицаДанных2.Колонки.Добавить(Ф.КолонкаДанных("ФИО", Ф.ТипДанных.Строка));

Стр13 = "Трифонов Юрий Никифорович
|Шигаев Агап Денисович
|Сочеванова Анфиса Георгиевна
|Врунгель Христофор Бонифатьевич
|Шикалов Игнатий Маркович
|Сергеевич Аристарх Изяславович
|Бондарчук Александр Ермолаевич
|Ефремова Ева Степановна
|Моисеева Зинаида Никитевна
|Кузьмова Лиана Игнатиевна
|Ковшутина Алина Игоревна
|Чемериса Дина Глебовна
|Сухоруков Давид Александрович
|Шагидзянова Наталия Николаевна
|Игошина Влада Емельяновна
|Бортник Борис Федосиевич
|Заболотный Евсей Фролович
|Сонин Викентий Мечиславович
|Коваленко Злата Фомевна
|Шатохина Людмила Александровна
|Пряхин Владислав Владимирович";
М_Счетчик = Новый Массив;
М_ФИО = Новый Массив;
Для А = 1 По СтрЧислоСтрок(Стр13) Цикл
	Стр14 = СтрПолучитьСтроку(Стр13, А);
	М9 = СтрРазделить(Стр14, ",");
	М_Счетчик.Добавить(А);
	М_ФИО.Добавить(М9[0]);
КонецЦикла;
Для А = 1 По СтрЧислоСтрок(Стр13) Цикл
	ТаблицаДанных1.Строки.Добавить(ТаблицаДанных1.НоваяСтрока());
	ТаблицаДанных2.Строки.Добавить(ТаблицаДанных2.НоваяСтрока());
КонецЦикла;
М_Счетчик2 = Ф.МассивСписок(М_Счетчик);
М_ФИО2 = Ф.МассивСписок(М_ФИО);

ТаблицаДанных1.ЗагрузитьКолонку(М_Счетчик2, 0);
ТаблицаДанных1.ЗагрузитьКолонку(М_ФИО2, 1);
ТаблицаДанных2.ЗагрузитьКолонку(М_ФИО2, 0);

СтильТаблицыСеткиДанных1 = Ф.СтильТаблицыСеткиДанных();
СтильТаблицыСеткиДанных1.ИмяОтображаемого = "ТД1";
СтильТаблицыСеткиДанных1.РазрешитьСортировку = Истина;
СтильТаблицыСеткиДанных1.СеткаДанных = СеткаДанных1;
СтильТаблицыСеткиДанных1.ТолькоЧтение = Ложь;
СтильТаблицыСеткиДанных1.ЦветФона = Ф.Цвет().БледноБирюзовый;
СтильТаблицыСеткиДанных1.ЦветФонаНечетныхСтрок = Ф.Цвет().Бирюзовый;
СтильТаблицыСеткиДанных1.ШиринаЗаголовковСтрок = 50;
СтильТаблицыСеткиДанных1.ШрифтЗаголовков = Ф.Шрифт(, 10, Ф.СтильШрифта.Подчеркнутый + Ф.СтильШрифта.Курсив);

СтилиКолонкиСеткиДанных1 = СтильТаблицыСеткиДанных1.СтилиКолонкиСеткиДанных;

СтильКолонкиПолеВвода1 = Ф.СтильКолонкиПолеВвода();
СтильКолонкиПолеВвода1.ИмяОтображаемого = "№ н/п";
СтильКолонкиПолеВвода1.Ширина = 50;
СтильКолонкиПолеВвода1.ТекстЗаголовка = "№ н/п";

СтильКолонкиПолеВыбора1 = Ф.СтильКолонкиПолеВыбора();
СтильКолонкиПолеВыбора1.ИмяОтображаемого = "ФИО";
СтильКолонкиПолеВыбора1.Ширина = 400;
СтильКолонкиПолеВыбора1.ТекстЗаголовка = "ФИО";
СтильКолонкиПолеВыбора1.Выравнивание = Ф.ГоризонтальноеВыравнивание.Лево;

ПолеВыбора1 = СтильКолонкиПолеВыбора1.ПолеВыбора;
ПолеВыбора1.ОтображениеЭлемента = "ФИО";
ПолеВыбора1.ЗначениеЭлемента = "ФИО";
ПолеВыбора1.ИсточникДанных = ТаблицаДанных2;

СтилиКолонкиСеткиДанных1.Добавить(СтильКолонкиПолеВвода1);
СтилиКолонкиСеткиДанных1.Добавить(СтильКолонкиПолеВыбора1);
СеткаДанных1.СтилиТаблицы.Добавить(СтильТаблицыСеткиДанных1);

СтильТаблицыСеткиДанных1.ПредпочтительнаяВысотаСтрок = ПолеВыбора1.Высота;
СеткаДанных1.ИсточникДанных = ТаблицаДанных1;
СтильКолонкиПолеВвода1.ТолькоЧтение = Истина;

СтильКолонкиПолеВвода1.ДвойноеНажатие = "СтильКолонкиПолеВвода1_ДвойноеНажатие()";

СеткаДанных1.ДвойноеНажатие = "СеткаДанных1_ДвойноеНажатие()";
СеткаДанных1.Нажатие = "СеткаДанных1_Нажатие()";
СеткаДанных1.ПриНажатииКнопкиМыши = "СеткаДанных1_ПриНажатииКнопкиМыши()";

Форма1.Текст = "Тест СтилиКолонкиСеткиДанных(GridColumnStylesCollection)";
Пока Ф.Продолжать Цикл
	Выполнить(Ф.ПолучитьСобытие());
КонецЦикла;
