// В файлах справки C:\444\OneScriptTerminalGui\docs\OSTGui\ находит страницы методов и свойств без тестовых кодов.

Процедура СтраницыБезТестовыхКодов()
	Таймер = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ПодключитьВнешнююКомпоненту("C:\444\111\OneScriptForms\OneScriptForms\bin\Debug\OneScriptForms.dll");
	Ф = Новый ФормыДляОдноСкрипта();
	
	ВыбранныеФайлы = НайтиФайлы("C:\444\OneScriptForms\docs\OneScriptFormsru", "*.html", Истина);
	БезТестов = 0;
	
	БезПримеров = 0;
	БезПолных = 0;
	БезТестовых = 0;

	ВсегоНайдено = 0;
	Для А = 0 По ВыбранныеФайлы.ВГраница() Цикл
		УчестьЭтотФайл = Ложь;
		// Сообщить("Файл " + А + " из " + ВыбранныеФайлы.ВГраница() + " - " + ВыбранныеФайлы[А].ПолноеИмя);
		ТекстДок = Новый ТекстовыйДокумент;
		ТекстДок.Прочитать(ВыбранныеФайлы[А].ПолноеИмя);
		Стр = ТекстДок.ПолучитьТекст();
		// 
		М = Ф.СтрНайтиМежду(Стр, "<H1 class=dtH1>", "</H1>", , );
		Если М.Количество > 0 Тогда
			Заголовок = Ф.СтрНайтиМежду(Стр, "<H1 class=dtH1>", "</H1>", , ).Элемент(0);
			Заголовок = СтрЗаменить(Заголовок, "&nbsp;", " ");
			ВсегоНайдено = ВсегоНайдено + 1;
			М0 = Ф.СтрНайтиМежду(Стр, "<H4 class=dtH4>Пример</H4>", "</PRE>", , );
			Для А1 = 0 По М0.Количество - 1 Цикл
				СтрКода = М0.Элемент(А1);
				СтрКода = СтрЗаменить(СтрКода, "<PRE class=code>", "");
				СтрКода = СтрЗаменить(СтрКода, "<P>", "");
				Если СтрДлина(СокрЛП(СтрКода)) > 0 Тогда
					
				Иначе
					УчестьЭтотФайл = Истина;
					Сообщить("Нет примера " + ВыбранныеФайлы[А].ПолноеИмя + " " + Заголовок);
					БезПримеров = БезПримеров + 1;
				КонецЕсли;
			КонецЦикла;
			
			М1 = Ф.СтрНайтиМежду(Стр, "<DIV id=""cont1"">", "</DIV>", , );
			Для А1 = 0 По М1.Количество - 1 Цикл
				СтрКода = М1.Элемент(А1);
				Если СтрДлина(СокрЛП(СтрКода)) > 0 Тогда
					
				Иначе
					УчестьЭтотФайл = Истина;
					Сообщить("Нет полного примера " + ВыбранныеФайлы[А].ПолноеИмя + " " + Заголовок);
					БезПолных = БезПолных + 1;
				КонецЕсли;
			КонецЦикла;
			
			М2 = Ф.СтрНайтиМежду(Стр, "<DIV id=""cont2"">", "</DIV>", , );
			Для А1 = 0 По М2.Количество - 1 Цикл
				СтрКода= М2.Элемент(А1);
				Если СтрДлина(СокрЛП(СтрКода)) > 0 Тогда
					
				Иначе
					УчестьЭтотФайл = Истина;
					Сообщить("Нет теста " + ВыбранныеФайлы[А].ПолноеИмя + " " + Заголовок);
					БезТестовых = БезТестовых + 1;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Сообщить("" + ВыбранныеФайлы[А].ПолноеИмя);
		КонецЕсли;
		Если УчестьЭтотФайл Тогда
			БезТестов = БезТестов + 1;
		КонецЕсли;
	КонецЦикла;
	
	Сообщить("ВсегоНайдено = " + ВсегоНайдено);
	Сообщить("БезТестов = " + БезТестов);
	Сообщить("С тестами = " + (ВсегоНайдено - БезТестов));
	Сообщить("=================================================");
	Сообщить("БезПримеров = " + БезПримеров);
	Сообщить("БезПолных = " + БезПолных);
	Сообщить("БезТестовых = " + БезТестовых);
	
	Сообщить("Выполнено за: " + ((ТекущаяУниверсальнаяДатаВМиллисекундах() - Таймер)/1000)/60 + " мин.");
КонецПроцедуры//СтраницыБезТестовыхКодов()

СтраницыБезТестовыхКодов();
